{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["data_freq_time", 0, 0], ["data_dm_time", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": true, "dtype": true, "name": true, "sparse": false}, "inbound_nodes": [], "name": "data_freq_time"}, {"class_name": "InputLayer", "config": {"batch_input_shape": true, "dtype": true, "name": true, "sparse": false}, "inbound_nodes": [], "name": "data_dm_time"}, {"class_name": "Conv2D", "config": {"activation": true, "activity_regularizer": false, "bias_constraint": false, "bias_initializer": true, "bias_regularizer": false, "data_format": true, "dilation_rate": true, "filters": true, "kernel_constraint": false, "kernel_initializer": true, "kernel_regularizer": false, "kernel_size": true, "name": true, "padding": true, "strides": true, "trainable": true, "use_bias": true}, "inbound_nodes": [[["data_freq_time", 0, 0, {}]]], "name": "conv2d_1__0"}, {"class_name": "Conv2D", "config": {"activation": true, "activity_regularizer": false, "bias_constraint": false, "bias_initializer": true, "bias_regularizer": false, "data_format": true, "dilation_rate": true, "filters": true, "kernel_constraint": false, "kernel_initializer": true, "kernel_regularizer": false, "kernel_size": true, "name": true, "padding": true, "strides": true, "trainable": true, "use_bias": true}, "inbound_nodes": [[["data_dm_time", 0, 0, {}]]], "name": "conv2d_2__1"}, {"class_name": "Model", "config": {"input_layers": true, "layers": true, "name": true, "output_layers": true}, "inbound_nodes": [[["conv2d_1__0", 0, 0, {}]]], "name": "densenet201__0"}, {"class_name": "Model", "config": {"input_layers": true, "layers": true, "name": true, "output_layers": true}, "inbound_nodes": [[["conv2d_2__1", 0, 0, {}]]], "name": "vgg16__1"}, {"class_name": "BatchNormalization", "config": {"axis": true, "beta_constraint": false, "beta_initializer": true, "beta_regularizer": false, "center": true, "epsilon": true, "gamma_constraint": false, "gamma_initializer": true, "gamma_regularizer": false, "momentum": true, "moving_mean_initializer": true, "moving_variance_initializer": true, "name": true, "scale": true, "trainable": true}, "inbound_nodes": [[["densenet201__0", 1, 0, {}]]], "name": "batch_normalization_1"}, {"class_name": "BatchNormalization", "config": {"axis": true, "beta_constraint": false, "beta_initializer": true, "beta_regularizer": false, "center": true, "epsilon": true, "gamma_constraint": false, "gamma_initializer": true, "gamma_regularizer": false, "momentum": true, "moving_mean_initializer": true, "moving_variance_initializer": true, "name": true, "scale": true, "trainable": true}, "inbound_nodes": [[["vgg16__1", 1, 0, {}]]], "name": "batch_normalization_2"}, {"class_name": "Dropout", "config": {"name": true, "noise_shape": false, "rate": true, "seed": false, "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "dropout_1"}, {"class_name": "Dropout", "config": {"name": true, "noise_shape": false, "rate": true, "seed": false, "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "dropout_2"}, {"class_name": "Dense", "config": {"activation": true, "activity_regularizer": false, "bias_constraint": false, "bias_initializer": true, "bias_regularizer": false, "kernel_constraint": false, "kernel_initializer": true, "kernel_regularizer": false, "name": true, "trainable": true, "units": true, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"activation": true, "activity_regularizer": false, "bias_constraint": false, "bias_initializer": true, "bias_regularizer": false, "kernel_constraint": false, "kernel_initializer": true, "kernel_regularizer": false, "name": true, "trainable": true, "units": true, "use_bias": true}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_2"}, {"class_name": "Multiply", "config": {"name": true, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}], ["dense_2", 0, 0, {}]]], "name": "multiply_1"}, {"class_name": "BatchNormalization", "config": {"axis": true, "beta_constraint": false, "beta_initializer": true, "beta_regularizer": false, "center": true, "epsilon": true, "gamma_constraint": false, "gamma_initializer": true, "gamma_regularizer": false, "momentum": true, "moving_mean_initializer": true, "moving_variance_initializer": true, "name": true, "scale": true, "trainable": true}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "batch_normalization_3"}, {"class_name": "Activation", "config": {"activation": true, "name": true, "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Dense", "config": {"activation": true, "activity_regularizer": false, "bias_constraint": false, "bias_initializer": true, "bias_regularizer": false, "kernel_constraint": false, "kernel_initializer": true, "kernel_regularizer": false, "name": true, "trainable": true, "units": true, "use_bias": true}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "dense_3"}], "name": "model_3", "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.2.2"}